multiRegionCase/constant/fluidR1/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/fluidR1/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       39700;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       39900;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          40000;
        startFace       40100;
    }
    fluidR1_to_fluidR2
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          200;
        startFace       80100;
        sampleMode      nearestPatchFace;
        sampleRegion    fluidR2;
        samplePatch     fluidR2_to_fluidR1;
    }
)

// ************************************************************************* //
