multiRegionCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       79600;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       79800;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       80000;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          80000;
        startFace       80400;
    }
)

// ************************************************************************* //
