multiRegionCase/0/fluidR2/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    /*
    inlet
    {
        type            zeroGradient;
    }
    */
    fluidR2_to_fluidR1
    {
        type            fixedValue;
        value           $internalField;
    }
    fixedWalls
    {
        type            fixedValue;
        value           $internalField;
    }
}

// ************************************************************************* //
