multiRegionCase/0/fluidR1/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedGradient;
        gradient           uniform 20000;    //dT/dx = -q/K
    }

    /*
    outlet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }

    */
    fluidR1_to_fluidR2
    {
        type            zeroGradient;

    }
    fixedWalls
    {
        type            fixedValue;
        value           $internalField;
    }
}

// ************************************************************************* //
