multiRegionCase/system/cellMaxHeaterT
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2312
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out the maximum cell value for one or more fields.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/minMax/cellMinMax.cfg"

region heater;
fields (T);

// ************************************************************************* //
